movrequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tot="http://www.totvs.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <tot:SaveRecord>
         <!--Optional:-->
         <tot:DataServerName>MOVMOVIMENTOTBCDATA</tot:DataServerName>
         <!--Optional:-->
         <tot:XML>
         <MovMovimento>
  <TMOV>      
    <CODCOLIGADA>6</CODCOLIGADA>  <!-- de acordo com o produto -->
    <IDMOV>999999</IDMOV>  <!-- buscar em outra tabela - gautoinc -->
    <CODFILIAL>1</CODFILIAL>  <!-- sempre 1 -->
    <CODLOC>01.001</CODLOC>  
    <CODLOCENTREGA />  
    <CODLOCDESTINO />
    <NUMEROMOV>999999</NUMEROMOV>  
    <SERIE>2</SERIE>  
    <CODTMV>2.2.04</CODTMV>  
    <TIPO>A</TIPO>  
    <STATUS>N</STATUS>  
    <DATAEMISSAO>2022-02-18T00:00:00</DATAEMISSAO>  
    <DATASAIDA>2022-02-18T00:00:00</DATASAIDA>  
    <COMISSAOREPRES>0.0000</COMISSAOREPRES>  
    <NORDEM />  
    <NUMEROTRIBUTOS>0</NUMEROTRIBUTOS>  
    <VALORBRUTO>10.0000</VALORBRUTO>  
    <VALORLIQUIDO>10.0000</VALORLIQUIDO>  
    <VALOROUTROS>10.0000</VALOROUTROS>  
    <OBSERVACAO />  
    <PERCENTUALFRETE>0.0000</PERCENTUALFRETE>  
    <PERCENTUALSEGURO>0.0000</PERCENTUALSEGURO>  
    <PERCENTUALDESC>0.0000</PERCENTUALDESC>  
    <PERCENTUALDESP>0.0000</PERCENTUALDESP>  
    <PERCENTUALEXTRA1>0.0000</PERCENTUALEXTRA1>  
    <PERCENTUALEXTRA2>0.0000</PERCENTUALEXTRA2>  
    <PERCCOMISSAO>0.0000</PERCCOMISSAO>  
    <VIADETRANSPORTE />  
    <PESOLIQUIDO>0.0000</PESOLIQUIDO>  
    <PESOBRUTO>0.0000</PESOBRUTO>  
    <MARCA />  
    <NUMERO>0</NUMERO>  
    <QUANTIDADE>0.0000</QUANTIDADE>  
    <ESPECIE />  
    <CODTB3FLX>0000</CODTB3FLX>  
    <IDMOVLCTFLUXUS>0</IDMOVLCTFLUXUS>  
    <CODMOEVALORLIQUIDO>R$</CODMOEVALORLIQUIDO>  
    <DATABASEMOV>1997-08-26T00:00:00</DATABASEMOV>  
    <DATAMOVIMENTO>2022-02-18T00:00:00</DATAMOVIMENTO>  
    <NUMEROLCTGERADO>0</NUMEROLCTGERADO>  
    <GEROUFATURA>0</GEROUFATURA>  
    <NUMEROLCTABERTO>0</NUMEROLCTABERTO>  
    <FLAGEXPORTACAO>0</FLAGEXPORTACAO>  
    <EMITEBOLETA />  
    <FRETECIFOUFOB>1</FRETECIFOUFOB>  
    <USADESPFINANC>0</USADESPFINANC>  
    <FLAGEXPORFISC>0</FLAGEXPORFISC>  
    <FLAGEXPORFAZENDA>0</FLAGEXPORFAZENDA>  
    <VALORADIANTAMENTO>0.0000</VALORADIANTAMENTO>  
    <STATUSLIBERACAO>0</STATUSLIBERACAO>  
    <CODCFOAUX>CXXXXXXXXXX</CODCFOAUX>  
    <VALORRECEBIDO>0.0000</VALORRECEBIDO>  
    <SEGUNDONUMERO>0</SEGUNDONUMERO>  
    <CODVEN1>00000</CODVEN1>  
    <PERCCOMISSAOVEN2>0.0000</PERCCOMISSAOVEN2>  
    <CODUSUARIO>david.sousa</CODUSUARIO>  
    <CODFILIALDESTINO>0</CODFILIALDESTINO>  
    <GERADOPORLOTE>0</GERADOPORLOTE>  
    <STATUSEXPORTCONT>0</STATUSEXPORTCONT>  
    <DATAENTREGA>2022-02-18T00:00:00</DATAENTREGA>  
    <CAMPOLIVRE1 />  
    <CAMPOLIVRE2 />  
    <CAMPOLIVRE3 />  
    <GEROUCONTATRABALHO>0</GEROUCONTATRABALHO>  
    <GERADOPORCONTATRABALHO>0</GERADOPORCONTATRABALHO>  
    <HORULTIMAALTERACAO>2022-02-18T11:04:44</HORULTIMAALTERACAO>  
    <INDUSOOBJ>0.00</INDUSOOBJ>  
    <CONTABILIZADOPORTOTAL>0</CONTABILIZADOPORTOTAL>  
    <INTEGRADOBONUM>0</INTEGRADOBONUM>  
    <FLAGPROCESSADO>0</FLAGPROCESSADO>  
    <STSEMAIL>0</STSEMAIL>  
    <VINCULADOESTOQUEFL>0</VINCULADOESTOQUEFL>  
    <VRBASEINSSOUTRAEMPRESA>0.0000</VRBASEINSSOUTRAEMPRESA>  
    <CONTORCAMENTOANTIGO />  
    <SEQUENCIALESTOQUE />  
    <INTEGRADOAUTOMACAO>0</INTEGRADOAUTOMACAO>  
    <INTEGRAAPLICACAO>T</INTEGRAAPLICACAO>  
    <DATALANCAMENTO>2022-02-18T00:00:00</DATALANCAMENTO>  
    <EXTENPORANEO>0</EXTENPORANEO>  
    <USARATEIOVALORFIN>0</USARATEIOVALORFIN>  
    <CODCOLCFOAUX>0</CODCOLCFOAUX>  
    <!-- <AVISOPERMISSAO>Pedido já recebido!</AVISOPERMISSAO>   -->
    <FLAGCONCLUSAO>0</FLAGCONCLUSAO>  
    <STATUSPARADIGMA>N</STATUSPARADIGMA>  
    <STATUSINTEGRACAO>N</STATUSINTEGRACAO>  
    <!-- <CODCOLIGADA1>1</CODCOLIGADA1>   -->
    <!-- <IDMOVHST>1</IDMOVHST>   -->
  </TMOV>  
  <TNFE>  
    <CODCOLIGADA>6</CODCOLIGADA>  
    <IDMOV>999999</IDMOV>  
  </TNFE>  
  <TMOVFISCAL>  
    <CODCOLIGADA>6</CODCOLIGADA>  
    <IDMOV>999999</IDMOV>  
  </TMOVFISCAL>  
  <TITMMOV>  
    <IDMOV>1</IDMOV>  
    <CODFILIAL>1</CODFILIAL>  
    <NSEQITMMOV>1</NSEQITMMOV>  
    <NUMEROSEQUENCIAL>1</NUMEROSEQUENCIAL>  
    <QUANTIDADE>1.0000</QUANTIDADE>  
    <DATAEMISSAO>2022-02-18T00:00:00</DATAEMISSAO>  
    <CODUND>UN</CODUND>  
    <PRATELEIRA />  
    <QUANTIDADEARECEBER>1.0000</QUANTIDADEARECEBER>  
    <QUANTIDADETOTAL>1.0000</QUANTIDADETOTAL>  
    <CODLOC>01.001</CODLOC>  
    <VALORLIQUIDO>700.0000</VALORLIQUIDO>  
    <INTEGRAAPLICACAO>T</INTEGRAAPLICACAO>  
    <IDPRD>72877</IDPRD>
    <CODIGOPRD>160098</CODIGOPRD>
    <CODFAB>0099</CODFAB>
    <DESCRICAO>SISTEMA ENS. GALOIS VOL 1 - 2º ANO</DESCRICAO>
    <SERIE>11</SERIE>
    <DESCRICAO1>2ª Série</DESCRICAO1>
    <NOME>2ª Série</NOME>
    <PRECO1>700.0000</PRECO1>
    <NOMEFANTASIA>SISTEMA ENS. GALOIS VOL 1 - 2º ANO</NOMEFANTASIA>
    <CODCOLIGADA>6</CODCOLIGADA>
  </TITMMOV>   
  <TMOVCOMPL>  
    <CODCOLIGADA>6</CODCOLIGADA>  
    <IDMOV>999999</IDMOV>  
  </TMOVCOMPL>  
  <TMOVTRANSP>  
    <CODCOLIGADA>6</CODCOLIGADA>  
    <IDMOV>999999</IDMOV> 
  </TMOVTRANSP>  
</MovMovimento></tot:XML>
         <!--Optional:-->
         <tot:Contexto>CODSISTEMA=T;CODCOLIGADA=6;CODUSUARIO=eintegracao</tot:Contexto>
      </tot:SaveRecord>
   </soapenv:Body>
</soapenv:Envelope>